### Exercise 5. Find the mean and standard deviation of math and verbal SAT score for men-only, women-only, and non gender specific universities.

In [2]:
import pandas as pd

In [136]:
college = pd.read_csv('college.csv')
men_only = college.loc[college["menonly"] == 1.0]
women_only = college.loc[college["womenonly"] == 1.0]
non_gender = college.loc[(college["menonly"] == 0.0) & (college["womenonly"] == 0.0)]

men_only["type"] = "men"
women_only["type"] = "women"
non_gender["type"] = "non_gender"
new = pd.concat([men_only,women_only,non_gender]).groupby("type").agg({'satvrmid': ['mean', 'std'],'satmtmid': ['mean','std']})
new

/Users/zj/opt/anaconda3/envs/pydata/lib/python3.7/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/Users/zj/opt/anaconda3/envs/pydata/lib/python3.7/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys
/Users/zj/opt/anaconda3/envs/pydata/lib/python3.7/site-packages/ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

             satvrmid               satmtmid
                 mean        std        mean        std
type
men         558.00000  52.497619  566.400000  56.888487
non_gender  522.11342  68.497480  530.600343  73.581765
women       548.40000  70.657036  531.320000  71.709321

### Exercise 6. Find the top 3 universities with largest numbers of undergraduate students for each state

In [79]:
df = college.groupby(['stabbr']).apply(lambda x: x.nlargest(3,['ugds']))
df[["instnm","ugds"]]

                                        instnm     ugds
stabbr
AK     60       University of Alaska Anchorage  12865.0
       62       University of Alaska Fairbanks   5536.0
       66            Charter College-Anchorage   3256.0
AL     5             The University of Alabama  29851.0
       9                     Auburn University  20514.0
...                                        ...      ...
WV     4060           West Virginia University  21945.0
       4033                Marshall University   8871.0
WY     4137              University of Wyoming   9910.0
       4131   Laramie County Community College   3170.0
       4134  Western Wyoming Community College   2768.0

[165 rows x 2 columns]

### Exercise 7. Generate a DataFrame for the ratios of (number of employees of specific gender and race/total number of employees) for all race-gender combinations.

In [98]:
emp = pd.read_csv('employee.csv')
emp

,title,dept,salary,race,gender,hire_date
0,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Male,2015-02-03
1,ENGINEER/OPERATOR,Houston Fire Department (HFD),63166.0,White,Male,1982-02-08
2,SENIOR POLICE OFFICER,Houston Police Department-HPD,66614.0,Black,Male,1984-11-26
3,ENGINEER,Public Works & Engineering-PWE,71680.0,Asian,Male,2012-03-26
4,CARPENTER,Houston Airport System (HAS),42390.0,White,Male,2013-11-04
...,...,...,...,...,...,...
1648,POLICE OFFICER,Houston Police Department-HPD,43443.0,White,Male,2014-06-09
1649,COMMUNICATIONS CAPTAIN,Houston Fire Department (HFD),66523.0,Black,Male,2003-09-02
1650,POLICE OFFICER,Houston Police Department-HPD,43443.0,White,Male,2014-10-13
1651,POLICE OFFICER,Houston Police Department-HPD,55461.0,Asian,Male,2009-01-20
1652,FIRE FIGHTER,Houston Fire Department (HFD),51194.0,Hispanic,Male,2009-01-12

In [139]:
emp.groupby(["race","gender"]).size().div(len(emp)).reset_index(name="ratio")

              race  gender     ratio
0            Asian  Female  0.010889
1            Asian    Male  0.042347
2            Black  Female  0.130672
3            Black    Male  0.197217
4         Hispanic  Female  0.061101
5         Hispanic    Male  0.177858
6  Native American  Female  0.002420
7  Native American    Male  0.002420
8            White  Female  0.047187
9            White    Male  0.315789

### Exercise 8. Use pd.melt() to unpivot table pv3 to the format of pv4 in exampel above.

In [105]:
pv2 = emp.pivot_table(index='gender', columns='race', 
                      values='salary', aggfunc='mean').round(-3)
pv3 = pv2.reset_index()
pv3

race  gender    Asian    Black  Hispanic  Native American    White
0     Female  58000.0  48000.0   44000.0          59000.0  66000.0
1       Male  61000.0  52000.0   55000.0          69000.0  63000.0

In [107]:
pv4 = pv2.stack().reset_index()
pv4

   gender             race        0
0  Female            Asian  58000.0
1  Female            Black  48000.0
2  Female         Hispanic  44000.0
3  Female  Native American  59000.0
4  Female            White  66000.0
5    Male            Asian  61000.0
6    Male            Black  52000.0
7    Male         Hispanic  55000.0
8    Male  Native American  69000.0
9    Male            White  63000.0

In [131]:
pd.melt(pv3,id_vars=['gender']).sort_values("gender").set_index([pd.Index(list(range(10)))])

   gender             race    value
0  Female            Asian  58000.0
1  Female            Black  48000.0
2  Female         Hispanic  44000.0
3  Female  Native American  59000.0
4  Female            White  66000.0
5    Male            Asian  61000.0
6    Male            Black  52000.0
7    Male         Hispanic  55000.0
8    Male  Native American  69000.0
9    Male            White  63000.0